**Inclass material for Week 4: SQL Query using `pandas`**

This notebook was made based on main materials `4_SQL_Query.ipynb`

---

# SQL Query using `pandas`

**Training Objectives**

- Querying from SQL Databases
- SQL Joins
- SQL Conditional Statements
- Flavors and Common Operators
- End to end data analysis

# Working with SQL Databases

## Database Schema

Database `chinook.db` terdiri dari 11 tabel yang berisi sampel data dari sebuah toko yang menjual media digital:

- Data terkait media seperti pada tabel `tracks`, `albums`, `artists`, `genres`, `media_types`, `playlists`, `playlist_track` merupakan data asli dari library Apple iTunes.
- Informasi mengenai `customers` dan `employees` dibuat menggunakan nama dan alamat fiktif yang dapat ditemukan di Google maps, dan data lain yang diformat dengan baik (telepon, fax, email, dll).
- Informasi penjualan `invoices` dan `invoice_items` dihasilkan secara otomatis menggunakan data acak untuk periode tahun 2009-2013.

Skema berikut sering disebut sebagai **Entity Relationship Diagram (ERD)**, menunjukkan:
1. Entitas (Tabel)
2. Atribut (Kolom beserta tipe datanya)
3. Kardinalitas (Hubungan antar tabel)

![](assets/chinookschema2.png)

Gambar di atas adalah ERD untuk database chinook:

- **Satu database** terdiri dari **beberapa tabel**
- **Setiap tabel** terdiri dari beberapa **atribut/kolom**
- Terdapat kolom unik yang membedakan satu tabel dengan lainnya, disebut sebagai **Primary Key (PK)**. PK dapat digunakan sebagai kolom penghubung antar tabel saat dilakukan proses join (penggabungan) tabel.

Sebelum kita dapat melakukan pembacaan data, kita perlu menghubungkan Python dengan database yang ingin kita akses. Tiap koneksi database memerlukan library yang berbeda, tergantung database tersebut kompatibel dengan DBMS apa.

<br>

<details>
    <summary>‚ú® Connecting to MySQL</summary>
    
```python
import pymysql
  
conn = pymysql.connect(
    host = HOST_NAME,
    port = PORT_NUMBER,
    user = USER_NAME,
    password = PASSWORD,
    db = DATABASE_NAME)
```
</details>

<br>

<details>
    <summary>‚ú® Connecting to Oracle</summary>
    
```python
import cx_Oracle
  
# data source name from tnsnames.ora file
dsn_tns = cx_Oracle.makedsn(
    HOST_NAME,
    PORT_NUMBER
    service_name = SERVICE_NAME)

# connection
conn = cx_Oracle.connect(
    user = USER_NAME,
    password = PASSWORD,
    dsn = dsn_tns)
```
</details>

<br>

<details>
    <summary>‚ú® Connecting to PostgreSQL</summary>
    
```python
import psycopg2

conn = psycopg2.connect(
    host = HOST_NAME,
    port = PORT_NUMBER,
    user = USER_NAME,
    password = PASSWORD,
    database = DATABASE_NAME)
```
</details>

<br>

<details>
    <summary>‚ú® Connecting to Microsoft SQL Server</summary>
    
```python
import pyodbc 
conn = pyodbc.connect(
    'Driver={ODBC Driver 17 for SQL Server};'
    'Server=host;'
    'PORT=1433;'
    'UID=user;'
    'PWD=password;'
    'Database=database;')
```
</details>

Pada materi kali ini, kita akan menggunakan database _chinook_ yang kompatibel dengan SQLite, sehingga kita akan menggunakan library `sqlite3`. Library `sqlite3` merupakan library bawaan dari Python.

In [2]:
import sqlite3 
import pandas as pd

In [ ]:
# membuat object conn untuk connection
conn = sqlite3.connect(___)
conn

## `SELECT` Statements

`SELECT` digunakan untuk memilih **kolom** dari sebuah **tabel**.

Syntax `SELECT`:

```sql
SELECT <NAMA_KOLOM>
FROM <NAMA_TABLE>
```

‚ùì Misal, hanya ingin mengambil kolom `AlbumId` dan `Title` dari tabel `albums`

In [ ]:
# query
query = ___

Untuk membaca data pada database dengan SQL pada `pandas`, kita dapat menggunakan `pd.read_sql_query()` dan menyertakan connection yang telah dibuat:

```python
pd.read_sql_query(sql, con)
```
Parameter:
- `sql`: perintah query
- `con`: connection

In [ ]:
# read sql query

‚ùì Bagaimana jika kita ingin mengambil **semua kolom** dari tabel `albums`? Gunakan command `SELECT *`

In [ ]:
# query

# read sql query

In [ ]:
# sama dengan code di atas, query langsung ke parameter sql

üí° **Note**: Berbeda dari Python, perintah yang ada di SQL bersifat case **insensitive**. Query di atas dapat juga dituliskan sebagai `select * from albums`. Namun, demi kemudahan pembacaan, statement biasa dituliskan dengan huruf besar (dalam hal ini `SELECT` dan `FROM`).

In [ ]:
# code here

### ‚úÖ Knowledge Check

Kali ini, coba ambil semua kolom pada tabel `artists` kemudian simpan ke dalam sebuah object dataframe bernama `df_artist`.

**Pertanyaan:** Berapa baris & kolom yang ada pada dataframe `df_artist`?

<br>

<details>
    <summary><i>üëâ Klik di sini untuk hint</i></summary>
    
```python
___ = pd.read_sql_query("SELECT ___ FROM ___", conn)
```
</details>

In [ ]:
# your code here
df_artist = ____

Berikut adalah parameter yang sering digunakan dalam method `pd.read_sql_query()`:

- `sql`: SQL query dalam bentuk string
- `con`: object connection
- `index_col`: nama atau index kolom yang ingin dijadikan index (seperti pada `pd.read_csv()`)
- `parse_dates`: nama kolom yang ingin dikonversi menjadi tipe data `datetime64[ns]` (seperti pada `pd.read_csv()`)

> Kunjungi [official documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql_query.html) untuk detail lebih lanjut.

### `LIMIT` Statement

Statement `LIMIT` digunakan untuk mengambil beberapa baris pertama pada data.

‚ùì Ambil **5 baris pertama** dari tabel `artists` lalu jadikan kolom `ArtistId` sebagai index baris dengan parameter `index_col`.

In [ ]:
# code here

üí¨ **Discussion :** Apakah perbedaan statement `LIMIT` dengan `head()` di pandas dataframe?

In [ ]:
# code here

üßê Ambil 10 baris pertama dengan statement `LIMIT` dari tabel `albums` dan jadikan kolom `AlbumId` sebagai index

In [ ]:
# code here

## `JOIN` Statement

Statement `JOIN` digunakan untuk **menggabungkan dua tabel** menjadi satu tabel melalui **kolom penghubung** yang sama. Operasi `JOIN` dapat dilakukan lebih dari satu kali dalam satu SQL query. Berikut adalah diagram ilustrasi beberapa macam operasi SQL `JOIN`:

![](assets/sqljoins.png)

Credit: Data & Object Factory, LLC

- `LEFT JOIN` paling sering digunakan pada sebagian besar skenario bisnis. `LEFT JOIN` mengembalikan semua baris pada tabel kiri **terlepas** dari apakah ada baris yang cocok pada tabel kanan.
- `INNER JOIN` adalah tipe join yang sangat intuitif dan mudah dipahami. Query ini mengembalikan semua baris di tabel kiri yang cocok dengan tabel kanan.

**Note**:

- `RIGHT JOIN` hampir tidak pernah digunakan karena ekuivalen dengan `LEFT JOIN` hanya mengganti peletakkan tabel kiri dan kanannya saja.
- `FULL OUTER JOIN` sangat jarang digunakan. Selain alasan komputasi, tipe join ini mengembalikan semua baris dari kedua tabel terlepas dari apakah ada kecocokan atau tidak, sehingga menghasilkan DataFrame dengan banyak missing value.

Ilustrasi terkait ke-empat tipe join dapat dilihat pada [Visual JOIN](https://joins.spathon.com/).

Syntax `JOIN`:

```sql
SELECT <COLUMNS>
FROM <LEFT_TABLE>
[LEFT|INNER] JOIN <RIGHT_TABLE>
ON <LEFT_TABLE>.key = <RIGHT_TABLE>.key
```

Perhatikan kembali skema database `chinook.db`:

1. Tabel `albums`: 
    - `AlbumId`
    - `Title`
    - `ArtistId`


2. Tabel `artists`:
    - `ArtistId`
    - `Name` 
    
**Kasus:** Kita ingin mendapatkan DataFrame yang menampilkan semua baris dari kolom `AlbumId` dan `Title` secara lengkap, beserta kolom `Name` (tidak harus lengkap). Perhatikan bahwa kolom `Name` terdapat pada tabel `artists`, sedangkan kolom `AlbumId` dan `Title` terdapat pada tabel `albums`.

- Tabel kiri: albums
- Tabel kanan: artists

In [ ]:
# code here
pd.read_sql_query(
    "SELECT _____\
    FROM _____\
    LEFT JOIN ____\
    ON _____",
    conn
)

Perhatikan SQL query di atas:
- Tabel `albums` menjadi tabel kiri, sedangkan tabel `artists` menjadi tabel kanan.
- Kedua tabel digabungkan menggunakan operasi `LEFT JOIN` melalui key `ArtistId`.
- Penggunaan karakter backslash (`\`) ditujukan agar ke-empat baris SQL query dibaca sebagai satu kesatuan baris. Namun penggunaan backslash kurang efisien dan memiliki resiko error yang lebih tinggi. **Sebagai alternatif, Anda dapat mengapit SQL query dengan `"""` (petik tiga kali)**

In [ ]:
# code here
pd.read_sql_query(
    """
    SELECT ____
    FROM ____
    LEFT JOIN ____
    ON ____
    """,
    conn
)

Terkadang penamaan kolom ataupun tabel pada database cukup panjang dan redundan untuk diketik, ataupun belum cukup informatif.

Penggunaan statement `AS` dapat digunakan untuk melakukan **aliasing / rename** nama tabel maupun nama kolom.

In [ ]:
# code here

**Note**: Ketika nama tabel sudah dialiasing, harus menggunakan nama alias tersebut di seluruh query

> ‚ö†Ô∏è Hati-hati! Saat melakukan `LEFT JOIN`, peletakkan tabel kiri dan kanan sangat berpengaruh terhadap hasil penggabungan.

### ü§ø Dive Deeper 

Buatlah sebuah object dataframe bernama `df_tracks` yang menampilkan:

- Semua kolom pada tabel `tracks`
- Kolom `Title` pada tabel `albums`
- Kolom `Name` pada tabel `artists`
- Kolom `Name` pada tabel `genres`

Lalu set kolom `TrackId` menjadi index pada dataframe tersebut. Apabila sudah benar, seharusnya dataframe Anda memiliki 3503 baris dan 11 kolom.

<br>

<details>
    <summary><i>üëâ Klik di sini untuk hint</i></summary>

> **Hint 1**: Pada kasus ini, Anda wajib menggunakan syntax `<nama_tabel>.<nama_kolom>` pada statement `SELECT`. Hal ini karena terdapat nama kolom yang sama dari tabel yang berbeda. Jangan lupa untuk menggunakan aliasing `AS` agar nama kolom akhir tidak ambigu.
    
> **Hint 2**: Anda dapat menggunakan `SELECT tracks.*` untuk mengambil semua kolom pada tabel `tracks`

> **Hint 3**: Anda dapat melanjutkan hasil operasi `LEFT JOIN` dengan `LEFT JOIN` berikutnya. Sebagai referensi, berikut adalah struktur kodenya:
    
```python
___ = pd.read_sql_query(
    """
    SELECT ___
    FROM ___
    LEFT JOIN ___
    ON ___
    LEFT JOIN ___
    ON ___
    LEFT JOIN ___
    ON ___
    """, conn, index_col=___)
```
</details>

In [ ]:
# your code here

Gunakan object dataframe `df_tracks` yang telah Anda peroleh di atas dalam menjawab pertanyaan berikut:

1. Pilihlah semua nama genre yang terdapat pada 5 baris terakhir pada dataframe `df_tracks`. Jawaban bisa lebih dari satu.
    - [ ] Latin
    - [ ] Classical
    - [ ] Soundtrack
    - [ ] Pop

In [ ]:
# your code here

2. Di antara genre berikut, manakah yang **termasuk** dalam top 3 genre yang paling banyak muncul pada dataframe `df_tracks`? Buatlah sebuah tabel frekuensi dengan metode yang telah Anda pelajari!

    - [ ] Latin
    - [ ] Classical
    - [ ] Soundtrack
    - [ ] Pop

<br>

<details>
    <summary><i>üëâ Klik di sini untuk hint</i></summary>

Beberapa pilihan method yang dapat Anda gunakan:
    
- `.value_counts()`
- `pd.crosstab(index=___, columns=___)`
- `.pivot_table(index=___, aggfunc='count')`
- `.groupby().count()`
</details>

In [ ]:
# your code here

3. Gunakan `groupby()` pada kolom `ArtistName` untuk menghitung `mean()` dari `UnitPrice`. Anda akan melihat bahwa mayoritas artists memiliki rata-rata `UnitPrice` di angka 0.99, namun ada juga beberapa artists yang rata-ratanya 1.99. Dari nama artists berikut, pilihlah yang memiliki rata-rata `UnitPrice` sebesar 1.99:

    - [ ] The Office
    - [ ] Red Hot Chili Peppers
    - [ ] Frank Sinatra	
    - [ ] Aerosmith

In [ ]:
# your code here

## SQL Aggregation

Di `pandas`, kita bisa menggunakan ketiga method berikut untuk membuat tabel agregasi:

- `.crosstab()`
- `.pivot_table()`
- `.groupby()`

Sedangkan di SQL, kita menggunakan statement `GROUP BY` yang diletakkan setelah `SELECT ... FROM ...`.

Misal kita ingin mengetahui top 5 `CustomerId` berdasarkan jumlah besaran transaksinya (`Total`) dan juga tampilkan banyak transaksinya:

In [ ]:
top_cust = pd.read_sql_query("SELECT CustomerId, SUM(Total), \
                              COUNT(CustomerId) \
                              FROM invoices \
                              GROUP BY CustomerId \
                              ORDER BY SUM(Total) DESC \
                              LIMIT 5", conn, index_col='CustomerId')
top_cust

In [ ]:
# re-create the table above

Perhatikan bagaimana query di atas dapat mengambil 5 customer teratas dari tabel `invoices`:

1. Data dikelompokkan berdasarkan `CustomerId` dengan statement `GROUP BY`
2. Terdapat dua fungsi agregasi yang digunakan: `SUM()` dan `COUNT()`, masing-masing mengagregasikan kolom `Total` dan `CustomerId`. Berikut adalah fungsi agregasi yang sering digunakan: `SUM`,` AVG`, `COUNT`, `MIN`, dan `MAX`.
3. Statement `ORDER BY` ditambahkan untuk mengurutkan tabel berdasarkan kolom `SUM(Total)` secara `DESC`.

**Note**:

- SQL Statement `GROUP BY` ekuivalen dengan `.groupby()` pada `pandas`
- SQL Statement `ORDER BY` ekuivalen dengan `.sort_values()` pada `pandas`

### ü§ø Dive Deeper

Seorang produser musik ingin menciptakan lagu dengan mempertimbangkan genre yang akan laku di market. Sebelum mulai, ia terlebih dahulu melakukan riset tentang genre musik apa yang sedang hits saat ini. Sebagai seorang data analyst, Anda diminta untuk membantu produser musik dalam membuat keputusan yang tepat.

**Pertanyaan:** Tampilkan top 5 genre musik dengan jumlah lagu terjual paling banyak, sertakan juga dengan total quantity & price yang terjual.

<br>

<details>
    <summary><i>üëâ Klik di sini untuk hint</i></summary>
    
Berikut adalah code yang dapat Anda gunakan untuk mengetahui `genres` paling populer dari semua _item_ (lagu) yang terjual.

```python
top_genre = pd.read_sql_query(
    """
    SELECT
    genres.GenreId,
    genres.Name,
    ___(invoice_items.Quantity),
    ___(invoice_items.UnitPrice)
    FROM ___
    LEFT JOIN ___ ON ___
    LEFT JOIN ___ ON ___
    GROUP BY ___
    ORDER BY ___
    """,
    con=conn,
    index_col='GenreId'
```
</details>

In [ ]:
# your code here

üí° Panduan step-by-step:

1. Lakukan operasi `JOIN` tergantung dari kebutuhan kolom yang ingin dianalisis
2. Gunakan `GROUP BY` apabila ingin membuat tabel agregasi
3. Aplikasikan fungsi agregat pada `SELECT`
4. Tambahkan kolom yang relevan untuk ditampilkan pada `SELECT`
5. Urutkan data menggunakan `ORDER BY`

## `WHERE` Statements

Sampai di sini, kita telah mempelajari beberapa statement SQL yang sering digunakan:

- `SELECT` statement
- SQL `JOIN`
- Aliasing
- SQL Aggregation dengan `GROUP BY`

Sekarang, kita akan melihat teknik untuk melakukan **conditional subsetting** atau **filter baris** menggunakan statement `WHERE` yang diikuti dengan **kondisi**.

### Logical Operator

- Kondisi `WHERE` dapat dikombinasikan dengan logical operator: `IS`, `AND`, `OR`, dan `NOT`:
    - `IS` sama seperti notasi `=`
    - `IS NOT` seperti notasi `!=`
    
- Kondisi pada `WHERE` juga mendukung operator matematis seperti >, >=, <, dan <=

**Kasus 1**: kita ingin melakukan analisis terhadap semua data `invoices` yang ada di `BillingCountry` Germany, maka kita bisa menambahkan statement `WHERE` sebagai berikut:

In [ ]:
# code here

**Note**: Berbeda dengan `pandas` yang menggunakan 2 tanda sama dengan (`==`), tanda ekivalen pada SQL menggunakan 1 tanda sama dengan (`=`)

**Kasus 2**: Berlawanan dengan kasus di atas, misal kita ingin analisis semua data `invoices` dimana `BillingCountry` **selain** negara Germany:

In [ ]:
# code here

üßê Misalkan kita hanya tertarik untuk menganalisis data yang terjadi di Canada dan USA. Kira-kira bagaimana cara mengimplementasikannya dalam bentuk query SQL?

In [ ]:
# code here

### `IN` Operator

Operator `IN` memungkinkan kita menentukan beberapa nilai untuk perbandingan. Misalnya, seperti pada kasus sebelumnya, kita ingin mengambil semua data `invoices` yang terjadi di negara (`BillingCountry`) Canada dan juga USA:

In [ ]:
# code here

### ‚úÖ Knowledge Check


Ambillah seluruh data musik yang memiliki genre `Pop` dan `UnitPrice` dari tracknya adalah 0.99. Kemudian simpan ke object dataframe bernama `popmusic`.

**Pertanyaan:** Ada berapa baris pada dataframe `popmusic`?

<br>

<details>
    <summary><i>üëâ Klik di sini untuk hint</i></summary>
    
```python
popmusic = pd.read_sql_query(
    """
    SELECT tracks.*, genres.Name AS GenreName
    FROM ___
    LEFT JOIN ___
    ON ___
    WHERE ___
    """,
    conn,
    index_col='TrackId'
)
```
</details>

In [ ]:
# your code here

### Operating Dates

Mari kita melihat informasi pada table `invoices`

In [ ]:
df_invoice = pd.read_sql_query("""SELECT * 
        FROM invoices""", 
        conn)
df_invoice.head()

Terdapat kolom `InvoiceDate` yang berisi informasi transaksi pembelian dilakukan. 

Pada operasi kondisi pada statement `WHERE` sebelumnya, kita dapat mengambil semua data `invoices` pada negara Germany. Namun, juga umum untuk kita melakukan conditional query untuk mengambil data pada **rentang tanggal** tertentu.

**Kasus**: Kita ingin meninjau penjualan (`invoices`) di seluruh negara pada tahun 2012 saja.

In [ ]:
# your code here
df_invoice_2012 = ____

Cek tipe data pada kolom `InvoiceDate`

In [ ]:
# code here

Perhatikan bahwa `InvoiceDate` dikenali sebagai tipe data `object`. 

`pd.read_sql_query()` berperilaku seperti `pd.read_csv()`, yaitu secara default membaca tipe data suatu kolom sebagai numerik dan objek. Untuk mengubah tipe data suatu kolom menjadi `datetime64[ns]` saat pembacaan data, kita dapat menambahkan parameter `parse_dates`

In [ ]:
#code here
df_invoice_2012 = ____

‚ö†Ô∏è **Additional Information:**

Saat melakukan penarikan data pada database dengan menggunakan `pandas`, maka informasi data types akan dilakukan *implicit coercion* (secara otomatis diobah ke dalam bentuk tipe data yang paling general), namun pada skema *database* biasanya struktur tipe data kolom *date* sudah berupa *datetime* data types.

### `BETWEEN` Operator

Melanjutkan kasus sebelumnya, apabila kita ingin menggunakan kondisi pada rentang tertentu, pendekatan yang umum digunakan adalah operator `BETWEEN`. Silahkan lengkapi code berikut dan lihat apakah data yang terambil sama seperti sebelumnya:

```python
pd.read_sql_query("""SELECT *
        FROM invoices
        WHERE _____ BETWEEN '_____' AND '_____'
        """, 
        con=conn, 
        parse_dates='InvoiceDate')
```

In [ ]:
# code here

‚ö†Ô∏è **Hati-hati!**

Operator `BETWEEN` sejatinya adalah inclusive, di mana kondisi _start_ dan _end_-nya termasuk. Namun, saat kita membandingkan date (misal '2012-12-31') dengan datetime (pada kolom `InvoiceDate`), seakan-akan end tidak inclusive.

> `BETWEEN 2 AND 5` mengembalikan nilai 2, 3, 4, 5

In [ ]:
# bukti bahwa operator BETWEEN inclusive pada start dan end
pd.read_sql_query(
    """
    SELECT * FROM invoices
    WHERE InvoiceId BETWEEN 2 AND 5
    """,
    con=conn,
    parse_dates='InvoiceDate'
)

Sebagai eksperimen, cobalah ganti kondisi pada statement `WHERE` menjadi:

```
WHERE InvoiceDate BETWEEN '2012-01-01' AND '2012-12-30'
```

Maka `InvoiceDate` pada tanggal `2012-12-30` tidak masuk.

In [ ]:
# MASALAH: ketika hanya menggunakan '2012-12-30' maka data tanggal 30 Desember 2012 TIDAK masuk
pd.read_sql_query(sql=
        """SELECT *
        FROM invoices
        WHERE InvoiceDate BETWEEN '2012-01-01' AND '2012-12-30'
        """, 
        con=conn, 
        parse_dates='InvoiceDate')

Sebagai solusinya, lebih baik kita menambahkan komponen waktu (time) pada kondisi:
```
WHERE InvoiceDate BETWEEN '2012-01-01 00:00:00' AND '2012-12-30 23:59:59'
```

In [ ]:
# code here

### `LIKE` Operator

Operator `LIKE` sangat berguna jika kita perlu mencocokan bagian tertentu dari sebuah string daripada menggunakan operator sama dengan (`=`).

Pada query di bawah ini, `'107%'` ditujukan untuk mengekstrak nilai `BillingPostalCode` yang **dimulai** dengan angka 107. Ini sangat membantu ketika Anda ingin mengekstrak data hanya pada wilayah tertentu.

üí° **Note:** Karakter `%` disebut juga sebagai [wildcard character](https://www.w3schools.com/sql/sql_wildcards.asp)

In [ ]:
#code here

üßê **Kasus**: Pada 5 data pertama `customerinv`, kita bisa melihat kolom `Company` mungkin tidak dapat diandalkan karena bernilai `None`. Tetapi jika Anda memperhatikan kolom `Email`, Anda dapat melihat beberapa customer memiliki domain email `apple`, yang bisa menjadi indikator perusahaan mereka.

In [ ]:
customerinv = pd.read_sql_query(
    """
    SELECT FirstName, LastName, Email, Company, InvoiceId, InvoiceDate, BillingCountry, Total
    FROM invoices
    LEFT JOIN customers
    ON invoices.CustomerId = customers.CustomerId
    """,
    con=conn)

customerinv.head()

**Pertanyaan:** Bagaimana jika kita ingin mengambil data pembelian dari pelanggan yang memiliki domain email `apple`?

Silahkan lengkapi kode berikut:

```python
applecust = pd.read_sql_query(
    """
    SELECT FirstName, LastName, Email, Company,
        InvoiceId, InvoiceDate, BillingCountry, Total
    FROM invoices
    LEFT JOIN customers
    ON invoices._____ = customers._____
    WHERE _____
    """,
    con=conn
)
```

Berdasarkan query tersebut, berapa pelanggan yang memiliki domain email `apple`?

- [ ] 412
- [ ] 49
- [ ] 7
- [ ] 14

In [ ]:
# your code here

## üìù Summary

### ‚úÖ Knowledge Check 1: SQL Statement Function

Kita telah mempelajari banyak statement pada SQL, silahkan mencocokan statement sesuai dengan kegunaannya:

**KEGUNAAN**

A. Memberikan nama lain pada tabel maupun kolom  

B. Mengambil beberapa baris teratas dari tabel  

C. Mengurutkan baris berdasarkan nilai pada kolom  

D. Mengambil kolom dari sebuah tabel  

E. Menggabungkan dua tabel menjadi satu tabel berdasarkan kolom penghubung  

F. Filter baris  

G. Membuat tabel agregasi  


**STATEMENT**

1. `SELECT <nama_kolom> FROM <nama_tabel>`
2. `LIMIT <banyaknya_baris>`
3. `AS <nama_kolom_atau_tabel>`
4. `<tabel_kiri> [LEFT|INNER] JOIN <tabel_kanan> ON <tabel>.key = <tabel>.key`
5. `GROUP BY <nama_kolom>`
6. `ORDER BY <nama_kolom> [ASC|DESC]`
7. `WHERE <kondisi>`

### ‚úÖ Knowledge Check 2: SQL Statement Structure

Susunlah 8 baris SQL statement berikut menjadi sebuah kerangka urutan syntax yang benar:

1. `GROUP BY <nama_kolom>`

2. `LIMIT <banyaknya_baris>`

3. `SELECT <nama_kolom> AS ...`

4. `[LEFT|INNER] JOIN <tabel_kanan> AS ...`

5. `ORDER BY <nama_kolom> [ASC|DESC]`

6. `FROM <nama_tabel> AS ...`

7. `WHERE <kondisi>`
    
8. `ON <tabel>.key = <tabel>.key`

> **JAWABAN**: Urutan yang benar adalah _______

---
### ü§ø Dive Deeper

Toko musik digital ini ingin memberikan satu penghargaan ke `employees` yang telah bekerja keras melakukan penjualan di `BillingCountry` Amerika Selatan (yaitu negara **Argentina, Brazil, dan Chile**). Apabila penghargaan tersebut diberikan kepada `employees` berdasarkan **jumlah `Total`** penjualan, siapakah yang berhak mendapatkannya? Tampilkan **nama lengkap (`FirstName` dan `LastName`) beserta total penjualannya**.

In [ ]:
# your code here


üí≠ **Diskusi**: Bagaimana jika kita ingin mengatahui negara mana saja (`BillingCountry`) yang menghasilkan total invoices lebih dari 150 dollar dengan menggunakan fungsi `WHERE`?

In [ ]:
# your code here

## **`HAVING` Statement**

Dalam SQL, Anda tidak bisa melakukan statment `WHERE` pada data yang ter aggregasi. Untuk melakukan filter pada data yang telah di aggregasi, Anda bisa menggunakan statement `HAVING`.

Mari selesaikan kasus di atas, yaitu mencari `BillingCountry` yang memiliki `Total` pembelian lebih dari 150 dollar pada tabel `invoices`.

In [ ]:
# your code here

---

# SQL Subquery

Dalam beberapa kasus tertentu, kita ingin melakukan filter baris berdasarkan syarat tertentu dimana nilai-nilai kondisi didapatkan dari hasil query lain. Apakah Anda masih ingat bagaimana kita mengambil semua pelanggan yang memiliki `invoices` dengan Total paling tinggi? (Bagian SQL Aggregation)

In [ ]:
# menampilkan top 5 customers dengan total pembelanjaan terbanyak
pd.read_sql_query("""SELECT CustomerId, SUM(Total) AS TotalSpent, COUNT(CustomerId) AS PurchaseCount
        FROM invoices
        GROUP BY CustomerId
        ORDER BY TotalSpent DESC
        LIMIT 5""", 
        con=conn, 
        index_col='CustomerId')

Misalnya dari tabel tersebut kita ingin menarik semua data `invoices` berdasarkan top 5 `customers`. Kita bisa saja menuliskan list `CustomerId` dalam kondisi secara **hard-code** seperti ini:

In [ ]:
# menampilkan invoices hanya untuk top 5 customers

top5cust_hardcode = pd.read_sql_query("""SELECT *
        FROM invoices
        WHERE ____
        """, 
        con=conn)
top5cust_hardcode

Namun cara tersebut tidak disarankan. Bagaimana jika database kita terus bertambah, sehingga bukan lagi `CustomerId` 6, 26, 57, 45, 46 yang merupakan top 5 customers? Maka dari itu, kita perlu menggunakan **subquery** agar query kita lebih **dinamis terhadap perubahan data**.

Untuk itu mari kita persiapkan subquery yang hanya mengembalikan list Top 5 `CustomerId` berdasarkan `Total` pembelian:

In [ ]:
# subquery

Subquery di atas kita gunakan untuk menggantikan query hard-code, setelah statement `WHERE` menggunakan operator `IN`:

In [ ]:
top5cust_subquery = pd.read_sql_query(____, conn)
top5cust_subquery

Memang hasil `top5cust_hardcode` dengan `top5cust_subquery` akan sama persis, namun secara sintaks `top5cust_subquery` jauh lebih baik karena code lebih dinamis.

---
# [OPTIONAL]Under and Over Fetching

Di antara semua tools yang telah kita pelajari untuk menganalisis data, sekarang saatnya kita merenungkan yang mana yang lebih cocok untuk Anda. Untuk meninjau, mari kita ingat kembali apa yang telah kita pelajari:

- Reading flat files (CSV file)
- Data cleansing and wrangling
- Exploratory data analysis tools
- Visual exploratory tools

Kira-kira SQL masuk ke bagian apa? Untuk menjawab hal tersebut, Anda perlu memahami arsitektur client-server.

![](assets/clientserver.png)

Ketika Anda bekerja dengan SQL, kemungkinan besar Anda memiliki database relasional yang disimpan terpusat pada _server_ dan dapat diakses oleh _client_. Pada dasarnya _server_ adalah komputer penyedia data, dan _client_ adalah komputer pengambil data (komputer Anda).

Saat Anda melakukan query, sebenarnya Anda sedang menjalankan perintah untuk mengunduh data ke komputer Anda (_local computer_). Proses pengunduhan ini membutuhkan sumber daya, sehingga pengunduhan perlu dilakukan secara efektif untuk meminimalkan biaya.

- **Over** fetching adalah kondisi ketika kita menarik data dari database **lebih dari** yang dibutuhkan, sehingga membutuhkan biaya dan waktu yang lebih.

- **Under** fetching adalah kondisi sebaliknya, dimana data yang ditarik **kurang dari** yang dibutuhkan, sehingga proses analisis tidak dapat dilakukan secara lengkap.

üí≠ **Diskusi**

Anda diminta untuk melakukan analisis terhadap semua penjualan lagu (`invoice_items`) genre `Rock` pada tahun 2012. Pertimbangkan pertanyaan berikut:

- Apakah perlu bagi Anda untuk mengunduh semua tabel `tracks` ke komputer lokal? Tidak, ambil yang Rock saja
- Apakah Anda melakukan filter baris terhadap `tracks` dengan genre `Rock` menggunakan SQL statement `WHERE` atau conditional subsetting `pandas`? Pakai WHERE
- Karena kita memerlukan informasi dari beberapa tabel, manakah cara yang lebih nyaman: melakukan query dengan `JOIN` atau melakukan `SELECT` secara terpisah dari database? Pakai JOIN

üßê Coba buat query yang paling optimum menurut Anda:

In [ ]:
# your code here